blog-posts/2006-01-18-todo-lists-in-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODO lists in Emacs!</title>
<!-- 2014-04-30 Wed 17:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">TODO lists in Emacs!</h1>
<p>
January 18th, 2006 -
<a href="http://sachachua.com/blog/p/3233"><a href="http://sachachua.com/blog/p/3233">http://sachachua.com/blog/p/3233</a></a>
</p>

<p>
E-mail addresses removed. But it's the real Stephen J. Turnbull&#x2026; =)
</p>

<pre class="example">
From: "Stephen J. Turnbull"
Subject: Re: TODO extension for source code and Emacs
To: tlug (Tokyo Linux Users Group)
Date: Wed Jan 18 14:17:40 2006 +0800

&gt;&gt;&gt;&gt;&gt; "Ian" == Ian Wells (ijw) writes:

    Ian&gt; Actually I was hoping for something that understood
    Ian&gt; todo-lists (i.e. allowed you to tick stuff off and add
    Ian&gt; unrelated items) but I think I may be fantasising.

(a) [the helpful answer] Find Sacha Chua (TLUG denizen), this is up
her alley.
</pre>

<p>
Will write a good reply on the plane.
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/goodkarma">goodkarma</a>,
<a href="http://www.technorati.com/tag/planner">planner</a>
</p>

<p>
E-Mail from Stephen J. Turnbull
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
